<a href="https://colab.research.google.com/github/NithishXplorer/SQL/blob/main/Types_Of_Creating_Table.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
%load_ext sql
%sql mysql+pymysql://root:root@127.0.0.1/test

In [ ]:
%%sql
show databases;

 * mysql+pymysql://root:***@127.0.0.1/test
8 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sql_practice',),
 ('sys',),
 ('test',),
 ('world',)]

In [ ]:
%%sql

use test;

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [ ]:
%%sql

create table student (
    sid int primary key,
    name varchar(30),
    age int not null,
    branch varchar(10) not null,
    course varchar(10) not null,
    cgpa decimal(10,5) # maximum 10 digit, after decimal point you can store 5 digits
);

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [ ]:
%%sql

select * from student;

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [ ]:
%%sql

# Inserting values into student table

INSERT INTO student (sid, name, age, branch, course, cgpa) VALUES
(100, 'Kumar', 20, 'B.Tech', 'CSE', 7.60300),
(101, 'Anjali', 21, 'B.Tech', 'ECE', 8.12045),
(102, 'Ravi', 22, 'B.Sc', 'Maths', 6.98765),
(103, 'Sneha', 20, 'B.Com', 'Accounts', 7.45678),
(104, 'Aman', 23, 'B.Tech', 'IT', 7.89012),
(105, 'Priya', 21, 'B.Sc', 'Physics', 9.12345),
(106, 'Deepak', 22, 'B.Tech', 'ME', 6.00000),
(107, 'Meena', 20, 'B.Tech', 'CSE', 8.54321),
(108, 'Arjun', 21, 'B.Com', 'Finance', 7.00000),
(109, 'Neha', 22, 'B.Sc', 'Chem', 7.77777);

# Reading all(*) data from the student table
select * from student;

 * mysql+pymysql://root:***@127.0.0.1/test
10 rows affected.
10 rows affected.

[(100, 'Kumar', 20, 'B.Tech', 'CSE', Decimal('7.60300')),
 (101, 'Anjali', 21, 'B.Tech', 'ECE', Decimal('8.12045')),
 (102, 'Ravi', 22, 'B.Sc', 'Maths', Decimal('6.98765')),
 (103, 'Sneha', 20, 'B.Com', 'Accounts', Decimal('7.45678')),
 (104, 'Aman', 23, 'B.Tech', 'IT', Decimal('7.89012')),
 (105, 'Priya', 21, 'B.Sc', 'Physics', Decimal('9.12345')),
 (106, 'Deepak', 22, 'B.Tech', 'ME', Decimal('6.00000')),
 (107, 'Meena', 20, 'B.Tech', 'CSE', Decimal('8.54321')),
 (108, 'Arjun', 21, 'B.Com', 'Finance', Decimal('7.00000')),
 (109, 'Neha', 22, 'B.Sc', 'Chem', Decimal('7.77777'))]

In [ ]:
%%sql

/*
Another way of creating the table CTAS (Create table as Select)
    -> CTAS stands for Create Table As Select.
    -> It creates a new table by copying the structure and/or data from an existing table or a query result.
*/

create table best_student as
select
    sid,
    name,
    age,
    branch,
    course,
    cgpa
from student
where cgpa >= 6.5;


# Reading all(*) data from the best_student table
select * from best_student;

 * mysql+pymysql://root:***@127.0.0.1/test
9 rows affected.
9 rows affected.

[(100, 'Kumar', 20, 'B.Tech', 'CSE', Decimal('7.60300')),
 (101, 'Anjali', 21, 'B.Tech', 'ECE', Decimal('8.12045')),
 (102, 'Ravi', 22, 'B.Sc', 'Maths', Decimal('6.98765')),
 (103, 'Sneha', 20, 'B.Com', 'Accounts', Decimal('7.45678')),
 (104, 'Aman', 23, 'B.Tech', 'IT', Decimal('7.89012')),
 (105, 'Priya', 21, 'B.Sc', 'Physics', Decimal('9.12345')),
 (107, 'Meena', 20, 'B.Tech', 'CSE', Decimal('8.54321')),
 (108, 'Arjun', 21, 'B.Com', 'Finance', Decimal('7.00000')),
 (109, 'Neha', 22, 'B.Sc', 'Chem', Decimal('7.77777'))]

In [ ]:
%%sql

/*

Another way of creating a table : Temporary table

A Temporary Table in SQL is used to store intermediate results temporarily during a session or a transaction.
It behaves like a regular table but automatically disappears after:
    The session ends (default), or
    The connection is closed
-> Here the session indicates the shell. The table automatically disappear when we comes away from the shell

*/



# Create Temporary table
create temporary table member (
    name varchar(30),
    cgpa decimal(10,5)
);

#show structure of that table (Describe)
desc member;

# We can insert data into temporary table by using select command
insert into member
select
    name,
    cgpa
from student
where cgpa >= 5;

select * from member;

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.
2 rows affected.
10 rows affected.
10 rows affected.

[('Kumar', Decimal('7.60300')),
 ('Anjali', Decimal('8.12045')),
 ('Ravi', Decimal('6.98765')),
 ('Sneha', Decimal('7.45678')),
 ('Aman', Decimal('7.89012')),
 ('Priya', Decimal('9.12345')),
 ('Deepak', Decimal('6.00000')),
 ('Meena', Decimal('8.54321')),
 ('Arjun', Decimal('7.00000')),
 ('Neha', Decimal('7.77777'))]

In [ ]:
%%sql

show tables;

 * mysql+pymysql://root:***@127.0.0.1/test
2 rows affected.

[('best_student',), ('student',)]

In [ ]:
%%sql

# CTE ( Common Table Expression )
WITH best_stud_cte AS (
    SELECT
        sid,
        name,
        age,
        branch,
        course,
        cgpa
    FROM student
    WHERE cgpa >= 8
)
SELECT * FROM best_stud_cte;

 * mysql+pymysql://root:***@127.0.0.1/test
3 rows affected.

[(101, 'Anjali', 21, 'B.Tech', 'ECE', Decimal('8.12045')),
 (105, 'Priya', 21, 'B.Sc', 'Physics', Decimal('9.12345')),
 (107, 'Meena', 20, 'B.Tech', 'CSE', Decimal('8.54321'))]

In [ ]:
%%sql

WITH high_cgpa AS (
    SELECT * FROM student WHERE cgpa > 8.5
)
SELECT * FROM high_cgpa;

 * mysql+pymysql://root:***@127.0.0.1/test
2 rows affected.

[(105, 'Priya', 21, 'B.Sc', 'Physics', Decimal('9.12345')),
 (107, 'Meena', 20, 'B.Tech', 'CSE', Decimal('8.54321'))]

In [ ]:
%%sql

WITH avg_cgpa AS (
    SELECT * FROM student WHERE cgpa < 7.5
)
SELECT * FROM avg_cgpa;

 * mysql+pymysql://root:***@127.0.0.1/test
4 rows affected.

[(102, 'Ravi', 22, 'B.Sc', 'Maths', Decimal('6.98765')),
 (103, 'Sneha', 20, 'B.Com', 'Accounts', Decimal('7.45678')),
 (106, 'Deepak', 22, 'B.Tech', 'ME', Decimal('6.00000')),
 (108, 'Arjun', 21, 'B.Com', 'Finance', Decimal('7.00000'))]